susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G0Bx.h
/*
  * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
*/

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CEC_PA5_ PA5,GPIO_AF1
#define CEC_PB10_ PB10,GPIO_AF0
#define CEC_PB8_ PB8,GPIO_AF0
#define _CEC_PA5_ 1
#define _CEC_PB10_ 1
#define _CEC_PB8_ 1

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define COMP1_OUT_PB0_ PB0,GPIO_AF7
#define COMP1_OUT_PB10_ PB10,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA6_ 1
#define _COMP1_OUT_PB0_ 1
#define _COMP1_OUT_PB10_ 1

#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define COMP2_OUT_PB11_ PB11,GPIO_AF7
#define COMP2_OUT_PB5_ PB5,GPIO_AF7
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1
#define _COMP2_OUT_PB11_ 1
#define _COMP2_OUT_PB5_ 1

#define COMP3_OUT_PB1_ PB1,GPIO_AF7
#define COMP3_OUT_PC0_ PC0,GPIO_AF7
#define COMP3_OUT_PC2_ PC2,GPIO_AF7
#define _COMP3_OUT_PB1_ 1
#define _COMP3_OUT_PC0_ 1
#define _COMP3_OUT_PC2_ 1

#define CRS1_SYNC_PA8_ PA8,GPIO_AF4
#define CRS1_SYNC_PD15_ PD15,GPIO_AF0
#define CRS1_SYNC_PF0_ PF0,GPIO_AF0
#define _CRS1_SYNC_PA8_ 1
#define _CRS1_SYNC_PD15_ 1
#define _CRS1_SYNC_PF0_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF7
#define EVENTOUT_PA10_ PA10,GPIO_AF7
#define EVENTOUT_PA13_ PA13,GPIO_AF7
#define EVENTOUT_PA14_ PA14,GPIO_AF7
#define EVENTOUT_PA15_ PA15,GPIO_AF7
#define EVENTOUT_PA3_ PA3,GPIO_AF7
#define EVENTOUT_PA4_ PA4,GPIO_AF7
#define EVENTOUT_PA5_ PA5,GPIO_AF7
#define EVENTOUT_PA8_ PA8,GPIO_AF7
#define EVENTOUT_PA9_ PA9,GPIO_AF7
#define EVENTOUT_PB12_ PB12,GPIO_AF7
#define EVENTOUT_PB13_ PB13,GPIO_AF7
#define EVENTOUT_PB14_ PB14,GPIO_AF7
#define EVENTOUT_PB15_ PB15,GPIO_AF7
#define EVENTOUT_PB2_ PB2,GPIO_AF7
#define EVENTOUT_PB3_ PB3,GPIO_AF7
#define EVENTOUT_PB4_ PB4,GPIO_AF7
#define EVENTOUT_PB6_ PB6,GPIO_AF7
#define EVENTOUT_PB7_ PB7,GPIO_AF7
#define EVENTOUT_PB8_ PB8,GPIO_AF7
#define EVENTOUT_PB9_ PB9,GPIO_AF7
#define EVENTOUT_PD0_ PD0,GPIO_AF0
#define EVENTOUT_PD1_ PD1,GPIO_AF0
#define EVENTOUT_PE0_ PE0,GPIO_AF1
#define EVENTOUT_PE1_ PE1,GPIO_AF1
#define EVENTOUT_PF0_ PF0,GPIO_AF1
#define EVENTOUT_PF1_ PF1,GPIO_AF1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA13_ 1
#define _EVENTOUT_PA14_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PD0_ 1
#define _EVENTOUT_PD1_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1
#define _EVENTOUT_PF0_ 1
#define _EVENTOUT_PF1_ 1

#define FDCAN1_RX_PB8_ PB8,GPIO_AF3
#define FDCAN1_RX_PC4_ PC4,GPIO_AF3
#define FDCAN1_RX_PD0_ PD0,GPIO_AF3
#define FDCAN1_RX_PD12_ PD12,GPIO_AF3
#define _FDCAN1_RX_PB8_ 1
#define _FDCAN1_RX_PC4_ 1
#define _FDCAN1_RX_PD0_ 1
#define _FDCAN1_RX_PD12_ 1

#define FDCAN1_TX_PB9_ PB9,GPIO_AF3
#define FDCAN1_TX_PC5_ PC5,GPIO_AF3
#define FDCAN1_TX_PD1_ PD1,GPIO_AF3
#define FDCAN1_TX_PD13_ PD13,GPIO_AF3
#define _FDCAN1_TX_PB9_ 1
#define _FDCAN1_TX_PC5_ 1
#define _FDCAN1_TX_PD1_ 1
#define _FDCAN1_TX_PD13_ 1

#define FDCAN2_RX_PB0_ PB0,GPIO_AF3
#define FDCAN2_RX_PB12_ PB12,GPIO_AF3
#define FDCAN2_RX_PB5_ PB5,GPIO_AF3
#define FDCAN2_RX_PC2_ PC2,GPIO_AF3
#define FDCAN2_RX_PD14_ PD14,GPIO_AF3
#define _FDCAN2_RX_PB0_ 1
#define _FDCAN2_RX_PB12_ 1
#define _FDCAN2_RX_PB5_ 1
#define _FDCAN2_RX_PC2_ 1
#define _FDCAN2_RX_PD14_ 1

#define FDCAN2_TX_PB1_ PB1,GPIO_AF3
#define FDCAN2_TX_PB13_ PB13,GPIO_AF3
#define FDCAN2_TX_PB6_ PB6,GPIO_AF3
#define FDCAN2_TX_PC3_ PC3,GPIO_AF3
#define FDCAN2_TX_PD15_ PD15,GPIO_AF3
#define _FDCAN2_TX_PB1_ 1
#define _FDCAN2_TX_PB13_ 1
#define _FDCAN2_TX_PB6_ 1
#define _FDCAN2_TX_PC3_ 1
#define _FDCAN2_TX_PD15_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF6
#define I2C1_SCL_PB6_ PB6,GPIO_AF6
#define I2C1_SCL_PB8_ PB8,GPIO_AF6
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF6
#define I2C1_SDA_PB7_ PB7,GPIO_AF6
#define I2C1_SDA_PB9_ PB9,GPIO_AF6
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF6
#define I2C1_SMBA_PB5_ PB5,GPIO_AF6
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PA7_ PA7,GPIO_AF8
#define I2C2_SCL_PA9_ PA9,GPIO_AF8
#define I2C2_SCL_PB10_ PB10,GPIO_AF6
#define I2C2_SCL_PB13_ PB13,GPIO_AF6
#define I2C2_SCL_PB3_ PB3,GPIO_AF8
#define _I2C2_SCL_PA7_ 1
#define _I2C2_SCL_PA9_ 1
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1
#define _I2C2_SCL_PB3_ 1

#define I2C2_SDA_PA10_ PA10,GPIO_AF8
#define I2C2_SDA_PA6_ PA6,GPIO_AF8
#define I2C2_SDA_PB11_ PB11,GPIO_AF6
#define I2C2_SDA_PB14_ PB14,GPIO_AF6
#define I2C2_SDA_PB4_ PB4,GPIO_AF8
#define _I2C2_SDA_PA10_ 1
#define _I2C2_SDA_PA6_ 1
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1
#define _I2C2_SDA_PB4_ 1

#define I2C2_SMBA_PA15_ PA15,GPIO_AF8
#define I2C2_SMBA_PA8_ PA8,GPIO_AF8
#define I2C2_SMBA_PB12_ PB12,GPIO_AF8
#define _I2C2_SMBA_PA15_ 1
#define _I2C2_SMBA_PA8_ 1
#define _I2C2_SMBA_PB12_ 1

#define I2C3_SCL_PA7_ PA7,GPIO_AF9
#define I2C3_SCL_PB3_ PB3,GPIO_AF6
#define I2C3_SCL_PC0_ PC0,GPIO_AF6
#define _I2C3_SCL_PA7_ 1
#define _I2C3_SCL_PB3_ 1
#define _I2C3_SCL_PC0_ 1

#define I2C3_SDA_PA6_ PA6,GPIO_AF9
#define I2C3_SDA_PB4_ PB4,GPIO_AF6
#define I2C3_SDA_PC1_ PC1,GPIO_AF6
#define _I2C3_SDA_PA6_ 1
#define _I2C3_SDA_PB4_ 1
#define _I2C3_SDA_PC1_ 1

#define I2S1_CK_PA1_ PA1,GPIO_AF0
#define I2S1_CK_PA5_ PA5,GPIO_AF0
#define I2S1_CK_PB3_ PB3,GPIO_AF0
#define I2S1_CK_PD8_ PD8,GPIO_AF1
#define I2S1_CK_PE13_ PE13,GPIO_AF0
#define _I2S1_CK_PA1_ 1
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1
#define _I2S1_CK_PD8_ 1
#define _I2S1_CK_PE13_ 1

#define I2S1_MCK_PA6_ PA6,GPIO_AF0
#define I2S1_MCK_PB4_ PB4,GPIO_AF0
#define I2S1_MCK_PD5_ PD5,GPIO_AF1
#define I2S1_MCK_PE14_ PE14,GPIO_AF0
#define _I2S1_MCK_PA6_ 1
#define _I2S1_MCK_PB4_ 1
#define _I2S1_MCK_PD5_ 1
#define _I2S1_MCK_PE14_ 1

#define I2S1_SD_PA2_ PA2,GPIO_AF0
#define I2S1_SD_PA7_ PA7,GPIO_AF0
#define I2S1_SD_PB5_ PB5,GPIO_AF0
#define I2S1_SD_PD6_ PD6,GPIO_AF1
#define I2S1_SD_PE15_ PE15,GPIO_AF0
#define _I2S1_SD_PA2_ 1
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1
#define _I2S1_SD_PD6_ 1
#define _I2S1_SD_PE15_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF0
#define I2S1_WS_PA4_ PA4,GPIO_AF0
#define I2S1_WS_PB0_ PB0,GPIO_AF0
#define I2S1_WS_PD9_ PD9,GPIO_AF1
#define I2S1_WS_PE12_ PE12,GPIO_AF0
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PB0_ 1
#define _I2S1_WS_PD9_ 1
#define _I2S1_WS_PE12_ 1

#define I2S2_CK_PA0_ PA0,GPIO_AF0
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF0
#define I2S2_CK_PB8_ PB8,GPIO_AF1
#define I2S2_CK_PD1_ PD1,GPIO_AF1
#define _I2S2_CK_PA0_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PB8_ 1
#define _I2S2_CK_PD1_ 1

