susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G0Bx.h
#define I2S2_MCK_PA3_ PA3,GPIO_AF0
#define I2S2_MCK_PA9_ PA9,GPIO_AF4
#define I2S2_MCK_PB14_ PB14,GPIO_AF0
#define I2S2_MCK_PB2_ PB2,GPIO_AF1
#define I2S2_MCK_PB6_ PB6,GPIO_AF4
#define I2S2_MCK_PC2_ PC2,GPIO_AF1
#define I2S2_MCK_PD3_ PD3,GPIO_AF1
#define _I2S2_MCK_PA3_ 1
#define _I2S2_MCK_PA9_ 1
#define _I2S2_MCK_PB14_ 1
#define _I2S2_MCK_PB2_ 1
#define _I2S2_MCK_PB6_ 1
#define _I2S2_MCK_PC2_ 1
#define _I2S2_MCK_PD3_ 1

#define I2S2_SD_PA10_ PA10,GPIO_AF0
#define I2S2_SD_PA4_ PA4,GPIO_AF1
#define I2S2_SD_PB11_ PB11,GPIO_AF0
#define I2S2_SD_PB15_ PB15,GPIO_AF0
#define I2S2_SD_PB7_ PB7,GPIO_AF1
#define I2S2_SD_PC3_ PC3,GPIO_AF1
#define I2S2_SD_PD4_ PD4,GPIO_AF1
#define _I2S2_SD_PA10_ 1
#define _I2S2_SD_PA4_ 1
#define _I2S2_SD_PB11_ 1
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PB7_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PD4_ 1

#define I2S2_WS_PA8_ PA8,GPIO_AF1
#define I2S2_WS_PB12_ PB12,GPIO_AF0
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PD0_ PD0,GPIO_AF1
#define _I2S2_WS_PA8_ 1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PD0_ 1

#define I2S_CKIN_PC9_ PC9,GPIO_AF0
#define _I2S_CKIN_PC9_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF0
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF5
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF0
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF5
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF0
#define LPTIM1_IN1_PC12_ PC12,GPIO_AF0
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1
#define _LPTIM1_IN1_PC12_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF5
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF0
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PA0_ PA0,GPIO_AF5
#define LPTIM1_OUT_PB0_ PB0,GPIO_AF5
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF5
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF0
#define LPTIM1_OUT_PD8_ PD8,GPIO_AF2
#define _LPTIM1_OUT_PA0_ 1
#define _LPTIM1_OUT_PB0_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1
#define _LPTIM1_OUT_PD8_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF5
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF2
#define LPTIM2_ETR_PD11_ PD11,GPIO_AF1
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1
#define _LPTIM2_ETR_PD11_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF5
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF2
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF1
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF5
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF5
#define LPTIM2_OUT_PD13_ PD13,GPIO_AF1
#define LPTIM2_OUT_PD6_ PD6,GPIO_AF2
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1
#define _LPTIM2_OUT_PD13_ 1
#define _LPTIM2_OUT_PD6_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF6
#define LPUART1_CTS_PB13_ PB13,GPIO_AF1
#define LPUART1_CTS_PF7_ PF7,GPIO_AF1
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PF7_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF6
#define LPUART1_DE_PB12_ PB12,GPIO_AF1
#define LPUART1_DE_PF6_ PF6,GPIO_AF1
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PF6_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF6
#define LPUART1_RTS_PB12_ PB12,GPIO_AF1
#define LPUART1_RTS_PF6_ PF6,GPIO_AF1
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PF6_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF6
#define LPUART1_RX_PB10_ PB10,GPIO_AF1
#define LPUART1_RX_PC0_ PC0,GPIO_AF1
#define LPUART1_RX_PF5_ PF5,GPIO_AF1
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PF5_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF6
#define LPUART1_TX_PB11_ PB11,GPIO_AF1
#define LPUART1_TX_PC1_ PC1,GPIO_AF1
#define LPUART1_TX_PF4_ PF4,GPIO_AF1
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PF4_ 1

#define LPUART2_CTS_PB0_ PB0,GPIO_AF10
#define LPUART2_CTS_PC8_ PC8,GPIO_AF3
#define LPUART2_CTS_PD14_ PD14,GPIO_AF1
#define _LPUART2_CTS_PB0_ 1
#define _LPUART2_CTS_PC8_ 1
#define _LPUART2_CTS_PD14_ 1

#define LPUART2_DE_PB1_ PB1,GPIO_AF10
#define LPUART2_DE_PC9_ PC9,GPIO_AF3
#define LPUART2_DE_PD15_ PD15,GPIO_AF1
#define LPUART2_DE_PF2_ PF2,GPIO_AF3
#define _LPUART2_DE_PB1_ 1
#define _LPUART2_DE_PC9_ 1
#define _LPUART2_DE_PD15_ 1
#define _LPUART2_DE_PF2_ 1

#define LPUART2_RTS_PB1_ PB1,GPIO_AF10
#define LPUART2_RTS_PC9_ PC9,GPIO_AF3
#define LPUART2_RTS_PD15_ PD15,GPIO_AF1
#define LPUART2_RTS_PF2_ PF2,GPIO_AF3
#define _LPUART2_RTS_PB1_ 1
#define _LPUART2_RTS_PC9_ 1
#define _LPUART2_RTS_PD15_ 1
#define _LPUART2_RTS_PF2_ 1

#define LPUART2_RX_PA13_ PA13,GPIO_AF10
#define LPUART2_RX_PB7_ PB7,GPIO_AF10
#define LPUART2_RX_PC1_ PC1,GPIO_AF3
#define LPUART2_RX_PC7_ PC7,GPIO_AF3
#define LPUART2_RX_PF3_ PF3,GPIO_AF1
#define _LPUART2_RX_PA13_ 1
#define _LPUART2_RX_PB7_ 1
#define _LPUART2_RX_PC1_ 1
#define _LPUART2_RX_PC7_ 1
#define _LPUART2_RX_PF3_ 1

#define LPUART2_TX_PA14_ PA14,GPIO_AF10
#define LPUART2_TX_PB6_ PB6,GPIO_AF10
#define LPUART2_TX_PC0_ PC0,GPIO_AF3
#define LPUART2_TX_PC6_ PC6,GPIO_AF3
#define LPUART2_TX_PF2_ PF2,GPIO_AF1
#define _LPUART2_TX_PA14_ 1
#define _LPUART2_TX_PB6_ 1
#define _LPUART2_TX_PC0_ 1
#define _LPUART2_TX_PC6_ 1
#define _LPUART2_TX_PF2_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PA9_ PA9,GPIO_AF0
#define RCC_MCO_PD10_ PD10,GPIO_AF0
#define RCC_MCO_PF2_ PF2,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PA9_ 1
#define _RCC_MCO_PD10_ 1
#define _RCC_MCO_PF2_ 1

#define RCC_MCO_2_PA10_ PA10,GPIO_AF3
#define RCC_MCO_2_PA15_ PA15,GPIO_AF3
#define RCC_MCO_2_PB2_ PB2,GPIO_AF3
#define RCC_MCO_2_PD7_ PD7,GPIO_AF3
#define _RCC_MCO_2_PA10_ 1
#define _RCC_MCO_2_PA15_ 1
#define _RCC_MCO_2_PB2_ 1
#define _RCC_MCO_2_PD7_ 1

#define RCC_OSC32_EN_PC15_ PC15,GPIO_AF0
#define _RCC_OSC32_EN_PC15_ 1

#define RCC_OSC_EN_PC15_ PC15,GPIO_AF1
#define RCC_OSC_EN_PF1_ PF1,GPIO_AF0
#define _RCC_OSC_EN_PC15_ 1
#define _RCC_OSC_EN_PF1_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define SPI1_MISO_PD5_ PD5,GPIO_AF1
#define SPI1_MISO_PE14_ PE14,GPIO_AF0
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PD5_ 1
#define _SPI1_MISO_PE14_ 1

#define SPI1_MOSI_PA2_ PA2,GPIO_AF0
#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define SPI1_MOSI_PD6_ PD6,GPIO_AF1
#define SPI1_MOSI_PE15_ PE15,GPIO_AF0
#define _SPI1_MOSI_PA2_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PD6_ 1
#define _SPI1_MOSI_PE15_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define SPI1_NSS_PB0_ PB0,GPIO_AF0
#define SPI1_NSS_PD9_ PD9,GPIO_AF1
#define SPI1_NSS_PE12_ PE12,GPIO_AF0
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB0_ 1
#define _SPI1_NSS_PD9_ 1
#define _SPI1_NSS_PE12_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF0
#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define SPI1_SCK_PD8_ PD8,GPIO_AF1
#define SPI1_SCK_PE13_ PE13,GPIO_AF0
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PD8_ 1
#define _SPI1_SCK_PE13_ 1

#define SPI2_MISO_PA3_ PA3,GPIO_AF0
#define SPI2_MISO_PA9_ PA9,GPIO_AF4
#define SPI2_MISO_PB14_ PB14,GPIO_AF0
#define SPI2_MISO_PB2_ PB2,GPIO_AF1
#define SPI2_MISO_PB6_ PB6,GPIO_AF4
#define SPI2_MISO_PC2_ PC2,GPIO_AF1
#define SPI2_MISO_PD3_ PD3,GPIO_AF1
#define _SPI2_MISO_PA3_ 1
#define _SPI2_MISO_PA9_ 1
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PB2_ 1
#define _SPI2_MISO_PB6_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PA10_ PA10,GPIO_AF0
#define SPI2_MOSI_PA4_ PA4,GPIO_AF1
#define SPI2_MOSI_PB11_ PB11,GPIO_AF0
#define SPI2_MOSI_PB15_ PB15,GPIO_AF0
#define SPI2_MOSI_PB7_ PB7,GPIO_AF1
#define SPI2_MOSI_PC3_ PC3,GPIO_AF1
#define SPI2_MOSI_PD4_ PD4,GPIO_AF1
#define _SPI2_MOSI_PA10_ 1
#define _SPI2_MOSI_PA4_ 1
#define _SPI2_MOSI_PB11_ 1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PB7_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PA8_ PA8,GPIO_AF1
#define SPI2_NSS_PB12_ PB12,GPIO_AF0
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF1
#define _SPI2_NSS_PA8_ 1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PA0_ PA0,GPIO_AF0
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF0
#define SPI2_SCK_PB8_ PB8,GPIO_AF1
#define SPI2_SCK_PD1_ PD1,GPIO_AF1
#define _SPI2_SCK_PA0_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PB8_ 1
#define _SPI2_SCK_PD1_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF9
#define SPI3_MISO_PC11_ PC11,GPIO_AF4
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF9
#define SPI3_MOSI_PC12_ PC12,GPIO_AF4
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF9
#define SPI3_NSS_PA4_ PA4,GPIO_AF9
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

