susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G0Bx.h
#define SPI3_SCK_PB3_ PB3,GPIO_AF9
#define SPI3_SCK_PC10_ PC10,GPIO_AF4
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define TIM14_CH1_PA4_ PA4,GPIO_AF4
#define TIM14_CH1_PA7_ PA7,GPIO_AF4
#define TIM14_CH1_PB1_ PB1,GPIO_AF0
#define TIM14_CH1_PC12_ PC12,GPIO_AF2
#define TIM14_CH1_PF0_ PF0,GPIO_AF2
#define _TIM14_CH1_PA4_ 1
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PB1_ 1
#define _TIM14_CH1_PC12_ 1
#define _TIM14_CH1_PF0_ 1

#define TIM15_BK_PA9_ PA9,GPIO_AF5
#define TIM15_BK_PB12_ PB12,GPIO_AF5
#define TIM15_BK_PB8_ PB8,GPIO_AF5
#define TIM15_BK_PC15_ PC15,GPIO_AF2
#define _TIM15_BK_PA9_ 1
#define _TIM15_BK_PB12_ 1
#define _TIM15_BK_PB8_ 1
#define _TIM15_BK_PC15_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF5
#define TIM15_CH1_PB14_ PB14,GPIO_AF5
#define TIM15_CH1_PC1_ PC1,GPIO_AF2
#define TIM15_CH1_PF12_ PF12,GPIO_AF0
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PC1_ 1
#define _TIM15_CH1_PF12_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF5
#define TIM15_CH1N_PB13_ PB13,GPIO_AF5
#define TIM15_CH1N_PB15_ PB15,GPIO_AF4
#define TIM15_CH1N_PF1_ PF1,GPIO_AF2
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB13_ 1
#define _TIM15_CH1N_PB15_ 1
#define _TIM15_CH1N_PF1_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF5
#define TIM15_CH2_PB15_ PB15,GPIO_AF5
#define TIM15_CH2_PC2_ PC2,GPIO_AF2
#define TIM15_CH2_PF13_ PF13,GPIO_AF0
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1
#define _TIM15_CH2_PC2_ 1
#define _TIM15_CH2_PF13_ 1

#define TIM16_BK_PB5_ PB5,GPIO_AF2
#define _TIM16_BK_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF5
#define TIM16_CH1_PB8_ PB8,GPIO_AF2
#define TIM16_CH1_PD0_ PD0,GPIO_AF2
#define TIM16_CH1_PE0_ PE0,GPIO_AF0
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PD0_ 1
#define _TIM16_CH1_PE0_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF2
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BK_PA10_ PA10,GPIO_AF5
#define TIM17_BK_PB4_ PB4,GPIO_AF5
#define _TIM17_BK_PA10_ 1
#define _TIM17_BK_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF5
#define TIM17_CH1_PB9_ PB9,GPIO_AF2
#define TIM17_CH1_PD1_ PD1,GPIO_AF2
#define TIM17_CH1_PE1_ PE1,GPIO_AF0
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PD1_ 1
#define _TIM17_CH1_PE1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF2
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BK_PA6_ PA6,GPIO_AF2
#define TIM1_BK_PB12_ PB12,GPIO_AF2
#define TIM1_BK_PC13_ PC13,GPIO_AF2
#define TIM1_BK_PD5_ PD5,GPIO_AF2
#define TIM1_BK_PE15_ PE15,GPIO_AF1
#define _TIM1_BK_PA6_ 1
#define _TIM1_BK_PB12_ 1
#define _TIM1_BK_PC13_ 1
#define _TIM1_BK_PD5_ 1
#define _TIM1_BK_PE15_ 1

#define TIM1_BK2_PC14_ PC14,GPIO_AF2
#define TIM1_BK2_PD9_ PD9,GPIO_AF2
#define TIM1_BK2_PE14_ PE14,GPIO_AF2
#define _TIM1_BK2_PC14_ 1
#define _TIM1_BK2_PD9_ 1
#define _TIM1_BK2_PE14_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF2
#define TIM1_CH1_PC8_ PC8,GPIO_AF2
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PC8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF2
#define TIM1_CH1N_PB13_ PB13,GPIO_AF2
#define TIM1_CH1N_PD2_ PD2,GPIO_AF2
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PD2_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF2
#define TIM1_CH2_PB3_ PB3,GPIO_AF1
#define TIM1_CH2_PC9_ PC9,GPIO_AF2
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PB3_ 1
#define _TIM1_CH2_PC9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF2
#define TIM1_CH2N_PB14_ PB14,GPIO_AF2
#define TIM1_CH2N_PD3_ PD3,GPIO_AF2
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PD3_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF2
#define TIM1_CH3_PB6_ PB6,GPIO_AF1
#define TIM1_CH3_PC10_ PC10,GPIO_AF2
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PB6_ 1
#define _TIM1_CH3_PC10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF2
#define TIM1_CH3N_PB15_ PB15,GPIO_AF2
#define TIM1_CH3N_PD4_ PD4,GPIO_AF2
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PD4_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PC11_ PC11,GPIO_AF2
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PC11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define _TIM1_ETR_PE7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF2
#define TIM2_CH1_PA5_ PA5,GPIO_AF2
#define TIM2_CH1_PC4_ PC4,GPIO_AF2
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PC4_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define TIM2_CH2_PC5_ PC5,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1
#define _TIM2_CH2_PC5_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB10_ PB10,GPIO_AF2
#define TIM2_CH3_PC6_ PC6,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1
#define _TIM2_CH3_PC6_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB11_ PB11,GPIO_AF2
#define TIM2_CH4_PC7_ PC7,GPIO_AF2
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1
#define _TIM2_CH4_PC7_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF2
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define TIM2_ETR_PC4_ PC4,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1
#define _TIM2_ETR_PC4_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF1
#define TIM3_CH1_PB4_ PB4,GPIO_AF1
#define TIM3_CH1_PC6_ PC6,GPIO_AF1
#define TIM3_CH1_PE3_ PE3,GPIO_AF1
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE3_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF1
#define TIM3_CH2_PB5_ PB5,GPIO_AF1
#define TIM3_CH2_PC7_ PC7,GPIO_AF1
#define TIM3_CH2_PE4_ PE4,GPIO_AF1
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE4_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF1
#define TIM3_CH3_PC8_ PC8,GPIO_AF1
#define TIM3_CH3_PE5_ PE5,GPIO_AF1
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE5_ 1

