susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G0Bx.h
#define TIM3_CH4_PB1_ PB1,GPIO_AF1
#define TIM3_CH4_PC9_ PC9,GPIO_AF1
#define TIM3_CH4_PE6_ PE6,GPIO_AF1
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE6_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF1
#define TIM3_ETR_PE2_ PE2,GPIO_AF1
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF9
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF9
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF9
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF9
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PE0_ 1

#define UART1_CK_PB3_ PB3,GPIO_AF4
#define _UART1_CK_PB3_ 1

#define UART1_CTS_PB4_ PB4,GPIO_AF4
#define _UART1_CTS_PB4_ 1

#define UART1_DE_PB3_ PB3,GPIO_AF4
#define _UART1_DE_PB3_ 1

#define UART1_NSS_PB4_ PB4,GPIO_AF4
#define _UART1_NSS_PB4_ 1

#define UART1_RTS_PB3_ PB3,GPIO_AF4
#define _UART1_RTS_PB3_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF1
#define UART1_RX_PB7_ PB7,GPIO_AF0
#define UART1_RX_PC5_ PC5,GPIO_AF1
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1
#define _UART1_RX_PC5_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF1
#define UART1_TX_PB6_ PB6,GPIO_AF0
#define UART1_TX_PC4_ PC4,GPIO_AF1
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PC4_ 1

#define UART2_CK_PA1_ PA1,GPIO_AF1
#define UART2_CK_PD4_ PD4,GPIO_AF0
#define _UART2_CK_PA1_ 1
#define _UART2_CK_PD4_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF1
#define UART2_CTS_PD3_ PD3,GPIO_AF0
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF1
#define UART2_DE_PD4_ PD4,GPIO_AF0
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_NSS_PA0_ PA0,GPIO_AF1
#define UART2_NSS_PD3_ PD3,GPIO_AF0
#define _UART2_NSS_PA0_ 1
#define _UART2_NSS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF1
#define UART2_RTS_PD4_ PD4,GPIO_AF0
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA15_ PA15,GPIO_AF1
#define UART2_RX_PA3_ PA3,GPIO_AF1
#define UART2_RX_PD6_ PD6,GPIO_AF0
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF1
#define UART2_TX_PA2_ PA2,GPIO_AF1
#define UART2_TX_PD5_ PD5,GPIO_AF0
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PA15_ PA15,GPIO_AF5
#define UART3_CK_PB1_ PB1,GPIO_AF4
#define UART3_CK_PB14_ PB14,GPIO_AF4
#define UART3_CK_PD12_ PD12,GPIO_AF0
#define UART3_CK_PD2_ PD2,GPIO_AF0
#define _UART3_CK_PA15_ 1
#define _UART3_CK_PB1_ 1
#define _UART3_CK_PB14_ 1
#define _UART3_CK_PD12_ 1
#define _UART3_CK_PD2_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF4
#define UART3_CTS_PB13_ PB13,GPIO_AF4
#define UART3_CTS_PD11_ PD11,GPIO_AF0
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PA15_ PA15,GPIO_AF5
#define UART3_DE_PB1_ PB1,GPIO_AF4
#define UART3_DE_PB14_ PB14,GPIO_AF4
#define UART3_DE_PD12_ PD12,GPIO_AF0
#define UART3_DE_PD2_ PD2,GPIO_AF0
#define _UART3_DE_PA15_ 1
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PD2_ 1

#define UART3_NSS_PA6_ PA6,GPIO_AF4
#define UART3_NSS_PB13_ PB13,GPIO_AF4
#define UART3_NSS_PD11_ PD11,GPIO_AF0
#define _UART3_NSS_PA6_ 1
#define _UART3_NSS_PB13_ 1
#define _UART3_NSS_PD11_ 1

#define UART3_RTS_PA15_ PA15,GPIO_AF5
#define UART3_RTS_PB1_ PB1,GPIO_AF4
#define UART3_RTS_PB14_ PB14,GPIO_AF4
#define UART3_RTS_PD12_ PD12,GPIO_AF0
#define UART3_RTS_PD2_ PD2,GPIO_AF0
#define _UART3_RTS_PA15_ 1
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PD2_ 1

#define UART3_RX_PB0_ PB0,GPIO_AF4
#define UART3_RX_PB11_ PB11,GPIO_AF4
#define UART3_RX_PB9_ PB9,GPIO_AF4
#define UART3_RX_PC11_ PC11,GPIO_AF0
#define UART3_RX_PC5_ PC5,GPIO_AF0
#define UART3_RX_PD9_ PD9,GPIO_AF0
#define _UART3_RX_PB0_ 1
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PB9_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PA5_ PA5,GPIO_AF4
#define UART3_TX_PB10_ PB10,GPIO_AF4
#define UART3_TX_PB2_ PB2,GPIO_AF4
#define UART3_TX_PB8_ PB8,GPIO_AF4
#define UART3_TX_PC10_ PC10,GPIO_AF0
#define UART3_TX_PC4_ PC4,GPIO_AF0
#define UART3_TX_PD8_ PD8,GPIO_AF0
#define _UART3_TX_PA5_ 1
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PB2_ 1
#define _UART3_TX_PB8_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CK_PA15_ PA15,GPIO_AF4
#define _UART4_CK_PA15_ 1

#define UART4_CTS_PB7_ PB7,GPIO_AF4
#define _UART4_CTS_PB7_ 1

#define UART4_DE_PA15_ PA15,GPIO_AF4
#define _UART4_DE_PA15_ 1

#define UART4_NSS_PB7_ PB7,GPIO_AF4
#define _UART4_NSS_PB7_ 1

#define UART4_RTS_PA15_ PA15,GPIO_AF4
#define _UART4_RTS_PA15_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF4
#define UART4_RX_PC11_ PC11,GPIO_AF1
#define UART4_RX_PE9_ PE9,GPIO_AF0
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PC11_ 1
#define _UART4_RX_PE9_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF4
#define UART4_TX_PC10_ PC10,GPIO_AF1
#define UART4_TX_PE8_ PE8,GPIO_AF0
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PC10_ 1
#define _UART4_TX_PE8_ 1

#define UART5_CK_PB5_ PB5,GPIO_AF8
#define UART5_CK_PD4_ PD4,GPIO_AF3
#define UART5_CK_PE7_ PE7,GPIO_AF3
#define _UART5_CK_PB5_ 1
#define _UART5_CK_PD4_ 1
#define _UART5_CK_PE7_ 1

#define UART5_CTS_PB6_ PB6,GPIO_AF8
#define UART5_CTS_PD5_ PD5,GPIO_AF3
#define UART5_CTS_PF7_ PF7,GPIO_AF3
#define _UART5_CTS_PB6_ 1
#define _UART5_CTS_PD5_ 1
#define _UART5_CTS_PF7_ 1

#define UART5_DE_PB5_ PB5,GPIO_AF8
#define UART5_DE_PD4_ PD4,GPIO_AF3
#define UART5_DE_PE7_ PE7,GPIO_AF3
#define _UART5_DE_PB5_ 1
#define _UART5_DE_PD4_ 1
#define _UART5_DE_PE7_ 1

#define UART5_NSS_PB6_ PB6,GPIO_AF8
#define UART5_NSS_PD5_ PD5,GPIO_AF3
#define UART5_NSS_PF7_ PF7,GPIO_AF3
#define _UART5_NSS_PB6_ 1
#define _UART5_NSS_PD5_ 1
#define _UART5_NSS_PF7_ 1

#define UART5_RTS_PB5_ PB5,GPIO_AF8
#define UART5_RTS_PD4_ PD4,GPIO_AF3
#define UART5_RTS_PE7_ PE7,GPIO_AF3
#define _UART5_RTS_PB5_ 1
#define _UART5_RTS_PD4_ 1
#define _UART5_RTS_PE7_ 1

#define UART5_RX_PB1_ PB1,GPIO_AF8
#define UART5_RX_PB4_ PB4,GPIO_AF3
#define UART5_RX_PD2_ PD2,GPIO_AF3
#define UART5_RX_PE11_ PE11,GPIO_AF3
#define _UART5_RX_PB1_ 1
#define _UART5_RX_PB4_ 1
#define _UART5_RX_PD2_ 1
#define _UART5_RX_PE11_ 1

