susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G0Bx.h
#define UART5_TX_PB0_ PB0,GPIO_AF8
#define UART5_TX_PB3_ PB3,GPIO_AF3
#define UART5_TX_PC12_ PC12,GPIO_AF3
#define UART5_TX_PD3_ PD3,GPIO_AF3
#define UART5_TX_PE10_ PE10,GPIO_AF3
#define _UART5_TX_PB0_ 1
#define _UART5_TX_PB3_ 1
#define _UART5_TX_PC12_ 1
#define _UART5_TX_PD3_ 1
#define _UART5_TX_PE10_ 1

#define UART6_CK_PA7_ PA7,GPIO_AF3
#define UART6_CK_PB14_ PB14,GPIO_AF8
#define UART6_CK_PF11_ PF11,GPIO_AF3
#define UART6_CK_PF3_ PF3,GPIO_AF3
#define _UART6_CK_PA7_ 1
#define _UART6_CK_PB14_ 1
#define _UART6_CK_PF11_ 1
#define _UART6_CK_PF3_ 1

#define UART6_CTS_PA6_ PA6,GPIO_AF3
#define UART6_CTS_PB15_ PB15,GPIO_AF8
#define UART6_CTS_PF12_ PF12,GPIO_AF3
#define _UART6_CTS_PA6_ 1
#define _UART6_CTS_PB15_ 1
#define _UART6_CTS_PF12_ 1

#define UART6_DE_PA7_ PA7,GPIO_AF3
#define UART6_DE_PB14_ PB14,GPIO_AF8
#define UART6_DE_PF11_ PF11,GPIO_AF3
#define UART6_DE_PF3_ PF3,GPIO_AF3
#define _UART6_DE_PA7_ 1
#define _UART6_DE_PB14_ 1
#define _UART6_DE_PF11_ 1
#define _UART6_DE_PF3_ 1

#define UART6_NSS_PA6_ PA6,GPIO_AF3
#define UART6_NSS_PB15_ PB15,GPIO_AF8
#define UART6_NSS_PF12_ PF12,GPIO_AF3
#define _UART6_NSS_PA6_ 1
#define _UART6_NSS_PB15_ 1
#define _UART6_NSS_PF12_ 1

#define UART6_RTS_PA7_ PA7,GPIO_AF3
#define UART6_RTS_PB14_ PB14,GPIO_AF8
#define UART6_RTS_PF11_ PF11,GPIO_AF3
#define UART6_RTS_PF3_ PF3,GPIO_AF3
#define _UART6_RTS_PA7_ 1
#define _UART6_RTS_PB14_ 1
#define _UART6_RTS_PF11_ 1
#define _UART6_RTS_PF3_ 1

#define UART6_RX_PA5_ PA5,GPIO_AF3
#define UART6_RX_PB9_ PB9,GPIO_AF8
#define UART6_RX_PC1_ PC1,GPIO_AF4
#define UART6_RX_PF10_ PF10,GPIO_AF3
#define _UART6_RX_PA5_ 1
#define _UART6_RX_PB9_ 1
#define _UART6_RX_PC1_ 1
#define _UART6_RX_PF10_ 1

#define UART6_TX_PA4_ PA4,GPIO_AF3
#define UART6_TX_PB8_ PB8,GPIO_AF8
#define UART6_TX_PC0_ PC0,GPIO_AF4
#define UART6_TX_PF9_ PF9,GPIO_AF3
#define _UART6_TX_PA4_ 1
#define _UART6_TX_PB8_ 1
#define _UART6_TX_PC0_ 1
#define _UART6_TX_PF9_ 1

#define UART7_CTS_PA6_ PA6,GPIO_AF6
#define UART7_CTS_PB13_ PB13,GPIO_AF1
#define UART7_CTS_PF7_ PF7,GPIO_AF1
#define _UART7_CTS_PA6_ 1
#define _UART7_CTS_PB13_ 1
#define _UART7_CTS_PF7_ 1

#define UART7_DE_PB1_ PB1,GPIO_AF6
#define UART7_DE_PB12_ PB12,GPIO_AF1
#define UART7_DE_PF6_ PF6,GPIO_AF1
#define _UART7_DE_PB1_ 1
#define _UART7_DE_PB12_ 1
#define _UART7_DE_PF6_ 1

#define UART7_RTS_PB1_ PB1,GPIO_AF6
#define UART7_RTS_PB12_ PB12,GPIO_AF1
#define UART7_RTS_PF6_ PF6,GPIO_AF1
#define _UART7_RTS_PB1_ 1
#define _UART7_RTS_PB12_ 1
#define _UART7_RTS_PF6_ 1

#define UART7_RX_PA3_ PA3,GPIO_AF6
#define UART7_RX_PB10_ PB10,GPIO_AF1
#define UART7_RX_PC0_ PC0,GPIO_AF1
#define UART7_RX_PF5_ PF5,GPIO_AF1
#define _UART7_RX_PA3_ 1
#define _UART7_RX_PB10_ 1
#define _UART7_RX_PC0_ 1
#define _UART7_RX_PF5_ 1

#define UART7_TX_PA2_ PA2,GPIO_AF6
#define UART7_TX_PB11_ PB11,GPIO_AF1
#define UART7_TX_PC1_ PC1,GPIO_AF1
#define UART7_TX_PF4_ PF4,GPIO_AF1
#define _UART7_TX_PA2_ 1
#define _UART7_TX_PB11_ 1
#define _UART7_TX_PC1_ 1
#define _UART7_TX_PF4_ 1

#define UART8_CTS_PB0_ PB0,GPIO_AF10
#define UART8_CTS_PC8_ PC8,GPIO_AF3
#define UART8_CTS_PD14_ PD14,GPIO_AF1
#define _UART8_CTS_PB0_ 1
#define _UART8_CTS_PC8_ 1
#define _UART8_CTS_PD14_ 1

#define UART8_DE_PB1_ PB1,GPIO_AF10
#define UART8_DE_PC9_ PC9,GPIO_AF3
#define UART8_DE_PD15_ PD15,GPIO_AF1
#define UART8_DE_PF2_ PF2,GPIO_AF3
#define _UART8_DE_PB1_ 1
#define _UART8_DE_PC9_ 1
#define _UART8_DE_PD15_ 1
#define _UART8_DE_PF2_ 1

#define UART8_RTS_PB1_ PB1,GPIO_AF10
#define UART8_RTS_PC9_ PC9,GPIO_AF3
#define UART8_RTS_PD15_ PD15,GPIO_AF1
#define UART8_RTS_PF2_ PF2,GPIO_AF3
#define _UART8_RTS_PB1_ 1
#define _UART8_RTS_PC9_ 1
#define _UART8_RTS_PD15_ 1
#define _UART8_RTS_PF2_ 1

#define UART8_RX_PA13_ PA13,GPIO_AF10
#define UART8_RX_PB7_ PB7,GPIO_AF10
#define UART8_RX_PC1_ PC1,GPIO_AF3
#define UART8_RX_PC7_ PC7,GPIO_AF3
#define UART8_RX_PF3_ PF3,GPIO_AF1
#define _UART8_RX_PA13_ 1
#define _UART8_RX_PB7_ 1
#define _UART8_RX_PC1_ 1
#define _UART8_RX_PC7_ 1
#define _UART8_RX_PF3_ 1

#define UART8_TX_PA14_ PA14,GPIO_AF10
#define UART8_TX_PB6_ PB6,GPIO_AF10
#define UART8_TX_PC0_ PC0,GPIO_AF3
#define UART8_TX_PC6_ PC6,GPIO_AF3
#define UART8_TX_PF2_ PF2,GPIO_AF1
#define _UART8_TX_PA14_ 1
#define _UART8_TX_PB6_ 1
#define _UART8_TX_PC0_ 1
#define _UART8_TX_PC6_ 1
#define _UART8_TX_PF2_ 1

#define UCPD1_FRSTX1_PA2_ PA2,GPIO_AF4
#define UCPD1_FRSTX1_PA5_ PA5,GPIO_AF6
#define UCPD1_FRSTX1_PA7_ PA7,GPIO_AF6
#define UCPD1_FRSTX1_PB0_ PB0,GPIO_AF6
#define UCPD1_FRSTX1_PB14_ PB14,GPIO_AF1
#define UCPD1_FRSTX1_PC12_ PC12,GPIO_AF1
#define UCPD1_FRSTX1_PC6_ PC6,GPIO_AF0
#define _UCPD1_FRSTX1_PA2_ 1
#define _UCPD1_FRSTX1_PA5_ 1
#define _UCPD1_FRSTX1_PA7_ 1
#define _UCPD1_FRSTX1_PB0_ 1
#define _UCPD1_FRSTX1_PB14_ 1
#define _UCPD1_FRSTX1_PC12_ 1
#define _UCPD1_FRSTX1_PC6_ 1

#define UCPD1_FRSTX2_PA2_ PA2,GPIO_AF4
#define UCPD1_FRSTX2_PA5_ PA5,GPIO_AF6
#define UCPD1_FRSTX2_PA7_ PA7,GPIO_AF6
#define UCPD1_FRSTX2_PB0_ PB0,GPIO_AF6
#define UCPD1_FRSTX2_PB14_ PB14,GPIO_AF1
#define UCPD1_FRSTX2_PC12_ PC12,GPIO_AF1
#define UCPD1_FRSTX2_PC6_ PC6,GPIO_AF0
#define _UCPD1_FRSTX2_PA2_ 1
#define _UCPD1_FRSTX2_PA5_ 1
#define _UCPD1_FRSTX2_PA7_ 1
#define _UCPD1_FRSTX2_PB0_ 1
#define _UCPD1_FRSTX2_PB14_ 1
#define _UCPD1_FRSTX2_PC12_ 1
#define _UCPD1_FRSTX2_PC6_ 1

#define UCPD2_FRSTX1_PA0_ PA0,GPIO_AF6
#define UCPD2_FRSTX1_PA3_ PA3,GPIO_AF4
#define UCPD2_FRSTX1_PA4_ PA4,GPIO_AF6
#define UCPD2_FRSTX1_PB12_ PB12,GPIO_AF6
#define UCPD2_FRSTX1_PB9_ PB9,GPIO_AF1
#define UCPD2_FRSTX1_PC7_ PC7,GPIO_AF0
#define UCPD2_FRSTX1_PC8_ PC8,GPIO_AF0
#define _UCPD2_FRSTX1_PA0_ 1
#define _UCPD2_FRSTX1_PA3_ 1
#define _UCPD2_FRSTX1_PA4_ 1
#define _UCPD2_FRSTX1_PB12_ 1
#define _UCPD2_FRSTX1_PB9_ 1
#define _UCPD2_FRSTX1_PC7_ 1
#define _UCPD2_FRSTX1_PC8_ 1

#define UCPD2_FRSTX2_PA0_ PA0,GPIO_AF6
#define UCPD2_FRSTX2_PA3_ PA3,GPIO_AF4
#define UCPD2_FRSTX2_PA4_ PA4,GPIO_AF6
#define UCPD2_FRSTX2_PB12_ PB12,GPIO_AF6
#define UCPD2_FRSTX2_PB9_ PB9,GPIO_AF1
#define UCPD2_FRSTX2_PC7_ PC7,GPIO_AF0
#define UCPD2_FRSTX2_PC8_ PC8,GPIO_AF0
#define _UCPD2_FRSTX2_PA0_ 1
#define _UCPD2_FRSTX2_PA3_ 1
#define _UCPD2_FRSTX2_PA4_ 1
#define _UCPD2_FRSTX2_PB12_ 1
#define _UCPD2_FRSTX2_PB9_ 1
#define _UCPD2_FRSTX2_PC7_ 1
#define _UCPD2_FRSTX2_PC8_ 1

#define USART1_CK_PB3_ PB3,GPIO_AF4
#define _USART1_CK_PB3_ 1

#define USART1_CTS_PB4_ PB4,GPIO_AF4
#define _USART1_CTS_PB4_ 1

#define USART1_DE_PB3_ PB3,GPIO_AF4
#define _USART1_DE_PB3_ 1

#define USART1_NSS_PB4_ PB4,GPIO_AF4
#define _USART1_NSS_PB4_ 1

#define USART1_RTS_PB3_ PB3,GPIO_AF4
#define _USART1_RTS_PB3_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF1
#define USART1_RX_PB7_ PB7,GPIO_AF0
#define USART1_RX_PC5_ PC5,GPIO_AF1
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1
#define _USART1_RX_PC5_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF1
#define USART1_TX_PB6_ PB6,GPIO_AF0
#define USART1_TX_PC4_ PC4,GPIO_AF1
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1
#define _USART1_TX_PC4_ 1

#define USART2_CK_PA1_ PA1,GPIO_AF1
#define USART2_CK_PD4_ PD4,GPIO_AF0
#define _USART2_CK_PA1_ 1
#define _USART2_CK_PD4_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF1
#define USART2_CTS_PD3_ PD3,GPIO_AF0
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF1
#define USART2_DE_PD4_ PD4,GPIO_AF0
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PD4_ 1

#define USART2_NSS_PA0_ PA0,GPIO_AF1
#define USART2_NSS_PD3_ PD3,GPIO_AF0
#define _USART2_NSS_PA0_ 1
#define _USART2_NSS_PD3_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF1
#define USART2_RTS_PD4_ PD4,GPIO_AF0
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA15_ PA15,GPIO_AF1
#define USART2_RX_PA3_ PA3,GPIO_AF1
#define USART2_RX_PD6_ PD6,GPIO_AF0
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF1
#define USART2_TX_PA2_ PA2,GPIO_AF1
#define USART2_TX_PD5_ PD5,GPIO_AF0
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PA15_ PA15,GPIO_AF5
#define USART3_CK_PB1_ PB1,GPIO_AF4
#define USART3_CK_PB14_ PB14,GPIO_AF4
#define USART3_CK_PD12_ PD12,GPIO_AF0
#define USART3_CK_PD2_ PD2,GPIO_AF0
#define _USART3_CK_PA15_ 1
#define _USART3_CK_PB1_ 1
#define _USART3_CK_PB14_ 1
#define _USART3_CK_PD12_ 1
#define _USART3_CK_PD2_ 1

