susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32G0Bx.h
#define USART3_CTS_PA6_ PA6,GPIO_AF4
#define USART3_CTS_PB13_ PB13,GPIO_AF4
#define USART3_CTS_PD11_ PD11,GPIO_AF0
#define _USART3_CTS_PA6_ 1
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_DE_PA15_ PA15,GPIO_AF5
#define USART3_DE_PB1_ PB1,GPIO_AF4
#define USART3_DE_PB14_ PB14,GPIO_AF4
#define USART3_DE_PD12_ PD12,GPIO_AF0
#define USART3_DE_PD2_ PD2,GPIO_AF0
#define _USART3_DE_PA15_ 1
#define _USART3_DE_PB1_ 1
#define _USART3_DE_PB14_ 1
#define _USART3_DE_PD12_ 1
#define _USART3_DE_PD2_ 1

#define USART3_NSS_PA6_ PA6,GPIO_AF4
#define USART3_NSS_PB13_ PB13,GPIO_AF4
#define USART3_NSS_PD11_ PD11,GPIO_AF0
#define _USART3_NSS_PA6_ 1
#define _USART3_NSS_PB13_ 1
#define _USART3_NSS_PD11_ 1

#define USART3_RTS_PA15_ PA15,GPIO_AF5
#define USART3_RTS_PB1_ PB1,GPIO_AF4
#define USART3_RTS_PB14_ PB14,GPIO_AF4
#define USART3_RTS_PD12_ PD12,GPIO_AF0
#define USART3_RTS_PD2_ PD2,GPIO_AF0
#define _USART3_RTS_PA15_ 1
#define _USART3_RTS_PB1_ 1
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1
#define _USART3_RTS_PD2_ 1

#define USART3_RX_PB0_ PB0,GPIO_AF4
#define USART3_RX_PB11_ PB11,GPIO_AF4
#define USART3_RX_PB9_ PB9,GPIO_AF4
#define USART3_RX_PC11_ PC11,GPIO_AF0
#define USART3_RX_PC5_ PC5,GPIO_AF0
#define USART3_RX_PD9_ PD9,GPIO_AF0
#define _USART3_RX_PB0_ 1
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PB9_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PA5_ PA5,GPIO_AF4
#define USART3_TX_PB10_ PB10,GPIO_AF4
#define USART3_TX_PB2_ PB2,GPIO_AF4
#define USART3_TX_PB8_ PB8,GPIO_AF4
#define USART3_TX_PC10_ PC10,GPIO_AF0
#define USART3_TX_PC4_ PC4,GPIO_AF0
#define USART3_TX_PD8_ PD8,GPIO_AF0
#define _USART3_TX_PA5_ 1
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PB2_ 1
#define _USART3_TX_PB8_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PC4_ 1
#define _USART3_TX_PD8_ 1

#define USART4_CK_PA15_ PA15,GPIO_AF4
#define _USART4_CK_PA15_ 1

#define USART4_CTS_PB7_ PB7,GPIO_AF4
#define _USART4_CTS_PB7_ 1

#define USART4_DE_PA15_ PA15,GPIO_AF4
#define _USART4_DE_PA15_ 1

#define USART4_NSS_PB7_ PB7,GPIO_AF4
#define _USART4_NSS_PB7_ 1

#define USART4_RTS_PA15_ PA15,GPIO_AF4
#define _USART4_RTS_PA15_ 1

#define USART4_RX_PA1_ PA1,GPIO_AF4
#define USART4_RX_PC11_ PC11,GPIO_AF1
#define USART4_RX_PE9_ PE9,GPIO_AF0
#define _USART4_RX_PA1_ 1
#define _USART4_RX_PC11_ 1
#define _USART4_RX_PE9_ 1

#define USART4_TX_PA0_ PA0,GPIO_AF4
#define USART4_TX_PC10_ PC10,GPIO_AF1
#define USART4_TX_PE8_ PE8,GPIO_AF0
#define _USART4_TX_PA0_ 1
#define _USART4_TX_PC10_ 1
#define _USART4_TX_PE8_ 1

#define USART5_CK_PB5_ PB5,GPIO_AF8
#define USART5_CK_PD4_ PD4,GPIO_AF3
#define USART5_CK_PE7_ PE7,GPIO_AF3
#define _USART5_CK_PB5_ 1
#define _USART5_CK_PD4_ 1
#define _USART5_CK_PE7_ 1

#define USART5_CTS_PB6_ PB6,GPIO_AF8
#define USART5_CTS_PD5_ PD5,GPIO_AF3
#define USART5_CTS_PF7_ PF7,GPIO_AF3
#define _USART5_CTS_PB6_ 1
#define _USART5_CTS_PD5_ 1
#define _USART5_CTS_PF7_ 1

#define USART5_DE_PB5_ PB5,GPIO_AF8
#define USART5_DE_PD4_ PD4,GPIO_AF3
#define USART5_DE_PE7_ PE7,GPIO_AF3
#define _USART5_DE_PB5_ 1
#define _USART5_DE_PD4_ 1
#define _USART5_DE_PE7_ 1

#define USART5_NSS_PB6_ PB6,GPIO_AF8
#define USART5_NSS_PD5_ PD5,GPIO_AF3
#define USART5_NSS_PF7_ PF7,GPIO_AF3
#define _USART5_NSS_PB6_ 1
#define _USART5_NSS_PD5_ 1
#define _USART5_NSS_PF7_ 1

#define USART5_RTS_PB5_ PB5,GPIO_AF8
#define USART5_RTS_PD4_ PD4,GPIO_AF3
#define USART5_RTS_PE7_ PE7,GPIO_AF3
#define _USART5_RTS_PB5_ 1
#define _USART5_RTS_PD4_ 1
#define _USART5_RTS_PE7_ 1

#define USART5_RX_PB1_ PB1,GPIO_AF8
#define USART5_RX_PB4_ PB4,GPIO_AF3
#define USART5_RX_PD2_ PD2,GPIO_AF3
#define USART5_RX_PE11_ PE11,GPIO_AF3
#define _USART5_RX_PB1_ 1
#define _USART5_RX_PB4_ 1
#define _USART5_RX_PD2_ 1
#define _USART5_RX_PE11_ 1

#define USART5_TX_PB0_ PB0,GPIO_AF8
#define USART5_TX_PB3_ PB3,GPIO_AF3
#define USART5_TX_PC12_ PC12,GPIO_AF3
#define USART5_TX_PD3_ PD3,GPIO_AF3
#define USART5_TX_PE10_ PE10,GPIO_AF3
#define _USART5_TX_PB0_ 1
#define _USART5_TX_PB3_ 1
#define _USART5_TX_PC12_ 1
#define _USART5_TX_PD3_ 1
#define _USART5_TX_PE10_ 1

#define USART6_CK_PA7_ PA7,GPIO_AF3
#define USART6_CK_PB14_ PB14,GPIO_AF8
#define USART6_CK_PF11_ PF11,GPIO_AF3
#define USART6_CK_PF3_ PF3,GPIO_AF3
#define _USART6_CK_PA7_ 1
#define _USART6_CK_PB14_ 1
#define _USART6_CK_PF11_ 1
#define _USART6_CK_PF3_ 1

#define USART6_CTS_PA6_ PA6,GPIO_AF3
#define USART6_CTS_PB15_ PB15,GPIO_AF8
#define USART6_CTS_PF12_ PF12,GPIO_AF3
#define _USART6_CTS_PA6_ 1
#define _USART6_CTS_PB15_ 1
#define _USART6_CTS_PF12_ 1

#define USART6_DE_PA7_ PA7,GPIO_AF3
#define USART6_DE_PB14_ PB14,GPIO_AF8
#define USART6_DE_PF11_ PF11,GPIO_AF3
#define USART6_DE_PF3_ PF3,GPIO_AF3
#define _USART6_DE_PA7_ 1
#define _USART6_DE_PB14_ 1
#define _USART6_DE_PF11_ 1
#define _USART6_DE_PF3_ 1

#define USART6_NSS_PA6_ PA6,GPIO_AF3
#define USART6_NSS_PB15_ PB15,GPIO_AF8
#define USART6_NSS_PF12_ PF12,GPIO_AF3
#define _USART6_NSS_PA6_ 1
#define _USART6_NSS_PB15_ 1
#define _USART6_NSS_PF12_ 1

#define USART6_RTS_PA7_ PA7,GPIO_AF3
#define USART6_RTS_PB14_ PB14,GPIO_AF8
#define USART6_RTS_PF11_ PF11,GPIO_AF3
#define USART6_RTS_PF3_ PF3,GPIO_AF3
#define _USART6_RTS_PA7_ 1
#define _USART6_RTS_PB14_ 1
#define _USART6_RTS_PF11_ 1
#define _USART6_RTS_PF3_ 1

#define USART6_RX_PA5_ PA5,GPIO_AF3
#define USART6_RX_PB9_ PB9,GPIO_AF8
#define USART6_RX_PC1_ PC1,GPIO_AF4
#define USART6_RX_PF10_ PF10,GPIO_AF3
#define _USART6_RX_PA5_ 1
#define _USART6_RX_PB9_ 1
#define _USART6_RX_PC1_ 1
#define _USART6_RX_PF10_ 1

#define USART6_TX_PA4_ PA4,GPIO_AF3
#define USART6_TX_PB8_ PB8,GPIO_AF8
#define USART6_TX_PC0_ PC0,GPIO_AF4
#define USART6_TX_PF9_ PF9,GPIO_AF3
#define _USART6_TX_PA4_ 1
#define _USART6_TX_PB8_ 1
#define _USART6_TX_PC0_ 1
#define _USART6_TX_PF9_ 1

#define USB_NOE_PA13_ PA13,GPIO_AF2
#define USB_NOE_PA15_ PA15,GPIO_AF6
#define USB_NOE_PA4_ PA4,GPIO_AF2
#define USB_NOE_PC9_ PC9,GPIO_AF6
#define _USB_NOE_PA13_ 1
#define _USB_NOE_PA15_ 1
#define _USB_NOE_PA4_ 1
#define _USB_NOE_PC9_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */